Revit 2024 API
AnalyticalMember.SectionTypeId Property
 The id of the type from the structural Family assigned to the Analytical Member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ElementId SectionTypeId { get; set; }
Visual Basic
Public Property SectionTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ SectionTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 The type must be of category "Structural Framing" (OST_StructuralFraming) or "Structural Columns" (OST_StructuralColumns)
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: sectionTypeId is the id of some element that is not a FamilySymbol or is not of the category "Structural Framing" (OST_StructuralFraming) or "Structural Columns" (OST_StructuralColumns)
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace